In [1]:
#creating a dataset to be used for further examples
import pandas as pd
data = {
    "Name" : ["Ram","Shyam","Ghanshyam","Sita","Geeta","Mohan","Chirag"],
    "Age" : [25,26,25,28,27,29,23],
    "Salary" : [20000,30000,35000,25000,22000,33000,40000],
    "City" : ["Delhi","Meerut","Pune","Noida","Gurugram","Ghaziabad","Meerut"]
}
df = pd.DataFrame(data)
print(df)

        Name  Age  Salary       City
0        Ram   25   20000      Delhi
1      Shyam   26   30000     Meerut
2  Ghanshyam   25   35000       Pune
3       Sita   28   25000      Noida
4      Geeta   27   22000   Gurugram
5      Mohan   29   33000  Ghaziabad
6     Chirag   23   40000     Meerut

#### MODIFICATION IN DATAFRAME

In [9]:
#to add any new column in DataFrame
df["Bonus"] = df["Salary"] * 0.05
print(df)

        Name  Age  Salary       City   Bonus
0        Ram   25   20000      Delhi  1000.0
1      Shyam   26   30000     Meerut  1500.0
2  Ghanshyam   25   35000       Pune  1750.0
3       Sita   28   25000      Noida  1250.0
4      Geeta   27   22000   Gurugram  1100.0
5      Mohan   29   33000  Ghaziabad  1650.0
6     Chirag   23   40000     Meerut  2000.0

In [11]:
#to insert at specific location
idx = 3
new_col = "Total_Salary"
new_data = df["Salary"] + df["Bonus"]
df.insert(idx,new_col,new_data)
print(df)

        Name  Age  Salary  Total_Salary       City   Bonus
0        Ram   25   20000       21000.0      Delhi  1000.0
1      Shyam   26   30000       31500.0     Meerut  1500.0
2  Ghanshyam   25   35000       36750.0       Pune  1750.0
3       Sita   28   25000       26250.0      Noida  1250.0
4      Geeta   27   22000       23100.0   Gurugram  1100.0
5      Mohan   29   33000       34650.0  Ghaziabad  1650.0
6     Chirag   23   40000       42000.0     Meerut  2000.0

In [12]:
#to remove specific column or columns
df.drop(columns = ["Total_Salary"], inplace =True)
print(df)

        Name  Age  Salary       City   Bonus
0        Ram   25   20000      Delhi  1000.0
1      Shyam   26   30000     Meerut  1500.0
2  Ghanshyam   25   35000       Pune  1750.0
3       Sita   28   25000      Noida  1250.0
4      Geeta   27   22000   Gurugram  1100.0
5      Mohan   29   33000  Ghaziabad  1650.0
6     Chirag   23   40000     Meerut  2000.0

In [13]:
# to update any specific value 
df.loc[0,"Bonus"] = 2000   #updated Ram's bonus
print(df)

        Name  Age  Salary       City   Bonus
0        Ram   25   20000      Delhi  2000.0
1      Shyam   26   30000     Meerut  1500.0
2  Ghanshyam   25   35000       Pune  1750.0
3       Sita   28   25000      Noida  1250.0
4      Geeta   27   22000   Gurugram  1100.0
5      Mohan   29   33000  Ghaziabad  1650.0
6     Chirag   23   40000     Meerut  2000.0

In [14]:
# to update the values of whole column
df["Bonus"] = df["Salary"] * 0.1         #updated bonus of all
print(df)

        Name  Age  Salary       City   Bonus
0        Ram   25   20000      Delhi  2000.0
1      Shyam   26   30000     Meerut  3000.0
2  Ghanshyam   25   35000       Pune  3500.0
3       Sita   28   25000      Noida  2500.0
4      Geeta   27   22000   Gurugram  2200.0
5      Mohan   29   33000  Ghaziabad  3300.0
6     Chirag   23   40000     Meerut  4000.0